const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test('20 + 1 เท่ากับ 21', ()=>{
  expect(sum(20,1)).toBe(21);
});

// 2 + 5 เท่ากับ ?
test('2 + 5 เท่ากับ 7', ()=>{
  expect(sum(2,5)).toBe(7);
});
// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy
test('6 + 6 เท่ากับ 12', ()=>{
  expect(sum(6,6)).toBe(12);
});

test('8 + 1 เท่ากับ 9', ()=>{
  expect(sum(8,1)).toBe(9);
});
test('100 + 1 เท่ากับ 101', ()=>{
  expect(sum(100,1)).toBe(101);
});
